In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [48]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.6/dist-packages (8.0.19)
Requirement already satisfied: protobuf==3.6.1 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.6.1)
Requirement already satisfied: dnspython==1.16.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (1.16.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (45.1.0)

In [0]:
#df_events = pd.read_csv('G:\Project\Capstone_project-1\events_data.csv')
#df_events.head()

In [55]:
import mysql.connector

cnx = mysql.connector.connect(host='cpanel.insaid.co',user='student', password='student',
                              database='Capstone1')
print(cnx)
cursor = cnx.cursor()
cursor.execute("SHOW TABLES") 

#tables = cursor.fetchall()
for table_names in cursor :
    print(table_names)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f06c88ad860>
('events_data',)
('gender_age_train',)
('phone_brand_device_model',)

In [56]:
cursor.execute("SELECT count(*) FROM events_data")
#cursor.fetchall()
for x in cursor:
  print("Row Count events_data rows:%d"%x)

cursor.execute("SELECT count(*) FROM gender_age_train")
#cursor.fetchall()
for x in cursor:
  print("Row Count gender_age_train rows:%d"%x)

cursor.execute("SELECT count(*) FROM phone_brand_device_model")
#cursor.fetchall()
for x in cursor:
  print("Row Count phone_brand_device_model rows:%d"%x)

#for Transfering Data from Mysql DB table to DataFrame
cursor.execute("SELECT * FROM gender_age_train")
table_rows = cursor.fetchall()
df_gender = pd.DataFrame(table_rows)
print("dataset of gender_age_train table")
df_gender.head()

#cursor.execute("SELECT * FROM events_data")
#table_rows = cursor.fetchall()
#df_event = pd.DataFrame(table_rows)
#print("dataset of events_data table")
#df_event.head()

#cursor.execute("SELECT * FROM phone_brand_device_model")
#table_rows = cursor.fetchall()
#df_device = pd.DataFrame(table_rows)
#print("dataset of phone_brand_device_model table")
#df_device.head()

#cnx.close()

Row Count events_data rows:3252950
Row Count gender_age_train rows:74645
Row Count phone_brand_device_model rows:87726
dataset of gender_age_train table

                     0  1   2       3
0 -8076087639492063270  M  35  M32-38
1 -2897161552818060146  M  35  M32-38
2 -8260683887967679142  M  35  M32-38
3 -4938849341048082022  M  30  M29-31
4   245133531816851882  M  30  M29-31